Repository: jiya-talreja/multi_language_detection
Catalog: backend/input/opus/en-hi.tmx
Source language: en
Languages: hi

source: She is ashamed of her old clothes.
hi: उसको अपने पुराने कपड़ो पर शर्म आती है।

source: She left the old newspapers lying in a heap.
hi: उसने पुराने अखबारों को एक ढेर में करके छोड़ दिया।

source: She is five years old.
hi: वह पाँच साल की है।

source: She bent down.
hi: वह नीचे झुकी।

source: She isn't running.
hi: वह भाग नहीं रही है।

source: Is she going to go to America this year?
hi: क्या वह इस साल अमरीका जाने वाली है?

source: She is appearing on TV tonight.
hi: वह आज टीवी पर आएगी।

source: She is busy at present and can't speak to you.
hi: वे अभी व्यस्थ हैं और आपसे बात नहीं कर सकतीं हैं।

source: She had a daughter by her first husband.
hi: उसकी अपने पहले पति से एक लड़की थी।

source: She was robbed of her purse.
hi: उसका पर्स उससे चुरा लिया गया।

source: She died yesterday afternoon.
hi: उनकी मौत कल दोपहर को हुई थी।

source: She passed away peacefully last night.
hi: वह कल रात आराम से चल बसीं।

source: She tried to kill herself last night.
hi: उसने कल रात ख़ुद की जान लेने की कोशिश की।

source: She is dealing out two apples to each child.
hi: वह हर बच्चे को दो सेव बाँट रही है।

source: She called her children into the room.
hi: उसने अपने बच्चों को कमरे में बुलाया।

source: She helped me pack my suitcase.
hi: उसने मुझे मेरी अटैची पैक करने में मदद करी।

source: She demanded that I should help him.
hi: उसने मुझसे उसकी मदद करने की माँग की।

source: She made tea for me.
hi: उसने मेरे लिये चाय बनाई।

source: She showed me a letter written in English.
hi: उसने मुझे अंग्रेज़ी में लिखी हुई चिट्ठी दिखाई।

source: She refused to notice me.
hi: उसने मुझे ध्यान में लेने से इनकार करदिआ।

source: She doesn't speak to me.
hi: वह मुझसे बात नहीं करती।

source: She got me a tiny toy.
hi: वह मेरे लिए एक नन्हा सा खिलौना खरीद लाई।

source: She pulled my shirt.
hi: उसने मेरी कमीज़ खींची।

source: She accused me of making a mistake.
hi: उसने मुझपर ग़लती करने का इलज़ाम लगाया।

source: She reproached me for being lazy.
hi: उसने मुझपर आलसी होने के लिए गुस्सा किया।

source: She is senior to me by three years.
hi: वह मुझसे तीन साल बड़ी है।

source: She got off at the next station.
hi: वह अगले स्टॉप पर उतर गई।

source: She can't ride a bicycle.
hi: वह साइकिल नहीं चला सकती।

source: She put down her thoughts on paper.
hi: उसने अपने विचार कागज़ पर उतार दिेए।

source: She felt insecure about her future.
hi: उसको अपना आने वाला कल थोड़ा डाँवाडोल लगा।

source: She has long arms and legs.
hi: उसके हाथ-पैर लम्बे हैं।

source: She reproached me for not answering the letter.
hi: उसने मुझे चिट्ठी का जवाब न देने के लिए डाँटा।

source: She forgot to mail the letter.
hi: वह चिट्ठी को डाक में डालना भूल गई।

source: She went to the market once a week.
hi: वह हफ़्ते में एक बार बाज़ार जाती थी।

source: She spoke in soft tones.
hi: उसने नर्म आवाज़ में बोला।

source: She went to Paris for the first time.
hi: वह पहली बार पैरिस गई थी।

source: She is not less than thirty.
hi: उसकी आयु तीस साल से कम नहीं है।

source: She can sing and dance beautifully.
hi: वह खूबसूरती से गा और नाच सकती है।

source: She has a gentle heart.
hi: वह नर्म दिल वाली है।

source: She was wandering in the woods.
hi: वह जंगल में भटक रही थी।

source: She resembles her sister in character.
hi: उसका चरित्र उसकी बहन से मिलता-जुलता है।

source: She wore a red dress.
hi: उसने लाल रंग के कपड़े पहने थे।

source: She left the baby crying.
hi: उसने बच्चे को रोते हुए छोड़ दिया।

source: She always complains of her teacher.
hi: वह हमेशा अपनी टीचर की शिक़ायत करती है।

source: She's worried as it's been many months since she heard from her son.
hi: वह चिंतित है क्योंकि पिछले कुछ महीनों से उसके बेटे की कोई भी ख़बर नहीं आई है।

source: She opened the window to free the kitchen of the smell.
hi: रसोई से बदबू निकालने के लिए उसने खिड़की खोली।

source: She reminds me very much of her mother.
hi: वह मुझे उसकी माँ की याद दिलाती है।

source: She was very surprised at the news.
hi: वह खबर सुनकर हैरान रह गई।

source: She is shy and talks little.
hi: वह शर्मीली है और कम बोलती है।

source: She was told off for being late.
hi: उसे देर से आने के लिए डाँट खानी पड़ी।

source: She didn't like living in the city.
hi: उसे शहर में रहना पसंद नहीं था।

source: She gazed at me for a long time.
hi: उसने मुझको बहुत देर तक घूरकर देखा।

source: She lived a long life.
hi: उसने लम्बी ज़िन्दगी जी।

source: She's in the garden planting roses.
hi: वह बगीचे में है, गुलाब के फूल लगा रही है।

source: She stared me down with anger.
hi: उसने मुझपर ग़ुस्से से घूरा।

source: All of a sudden, she began to laugh.
hi: वह अचानक से हँस पड़ी।

source: While in Japan, she bought the camera.
hi: जापान में होते वक़्त उसने वह कैमरा खरीदा।

source: She is in bed with a fever.
hi: वह बुखार के साथ बिस्तर में लेटी हुई है।

source: She takes care of her old mother.
hi: वह अपनी बूढ़ी माँ की देखभाल करती है।

source: She is dressed in white.
hi: उसने सफ़ेद कपड़े पहने हुएँ हैं।

source: She wears her hair in a bun.
hi: वह अपने बालों को जूड़े में बाँधती है।

source: She wanted to have her hair cut, but her mother wouldn't let her.
hi: वह अपने बाल कटवाना चाह्ती थी, पर उसकी मम्मी राज़ी नहीं थी।

source: She went into ecstasies about the ring he had bought her.
hi: वह उसकी खरीदी हुई अँगूठी को देखकर खुशी से पागल हो गई।

source: She warned him not to go alone.
hi: उसने उसे अकेले न जाने की चेतावनी दी।

source: She asked him to raise the funds.
hi: उसने उससे पैसे जुटाने के लिए कहा।

source: She gave him a watch.
hi: उसने उसे एक घड़ी दी।

source: She began to cry at the sight of his face.
hi: वह उसका चेहरा देखते ही रोने लगी।

source: She boiled over with rage at his betrayal.
hi: वह उसके धोखे पर गुस्से से ज्वाला हो गई।

source: She tried in vain to please him.
hi: उसने बेकार में उसको खुश करने की कोशिश की।

source: She is a beauty.
hi: वह तो हसीना है।

source: She's a beauty from a distance.
hi: वह दूर से हसीना लगती है।

source: She cannot attend school on account of illness.
hi: वह बीमारी की वजह से स्कूल नहीं जा सकती।

source: She is poor, but she looks happy.
hi: वह गरीब है, पर दिखने से खुश लगती है।

source: She was in despair when her husband died.
hi: जब उसके पति की मौत हो गई उसने सारी उम्मीद छोड़ दी।

source: She is not afraid of anything.
hi: वह किसी भी चीज़ से नहीं डरती है।

source: She is as beautiful as her mother.
hi: वह अपनी माँ जैसी सुंदर है।

source: She really takes after her mother.
hi: वह सचमुच अपने मां पर गई है।

source: She cried out the moment she saw her mother.
hi: उसने जैसे ही अपनी मम्मी को देखा, वह चिल्ला उठी।

source: She asked me if I knew her address.
hi: उसने मुझसे पूछा कि मैं उसका पता जानता था या नहीं।

source: She showed me her room.
hi: उसने मुझे अपना कमरा दिखाया।

source: She is angry with me.
hi: वह मुझसे नाराज़ है।

source: She is two years younger than me.
hi: वह मुझसे दो साल छोटी है।

source: She deposits 10,000 yen in the bank every month.
hi: वह हर महीने १०,००० येन बैंक में जमा करती है।

source: She used to play tennis every Sunday.
hi: वह हर रविवार टेनिस खेला करती थी।

source: She saved money for a rainy day.
hi: उसने बुरे वक्त के लिए पैसे बचाए।

source: She was only pretending to be asleep.
hi: वह सोना का बहाना कर रही थी।

source: Her face lit up.
hi: उसका चहरा चमक उठा।

source: She left the table after dinner.
hi: वह खाना खाने के बाद मेज़ से उठकर चली गई।

source: She is too young to go to school.
hi: वह स्कूल जाने के लिए अभी बहुत छोटी है।

source: She leaped for joy.
hi: वह खुशी से उछल पड़ी।

source: She may have to quit her job next month.
hi: उसे शायद अपनी नौकरी अगले महीने छोड़नी पड़ेगी।

source: She bought a dozen eggs.
hi: उसने एक दर्जन अंडे खरीदे।

source: She is busy preparing for the trip.
hi: वह सफ़र की तैयारी में लगी हुई है।

source: She looks better in Japanese clothes.
hi: वह जापानी कपड़ों में बेहतर लगती है।

source: Since he was tired, he went to bed.
hi: वह थक गया था, तो सोने चला गया।

source: There is no point in studying if you are feeling tired.
hi: अगर थक गए हो तो पढ़ाई करने से कोई फ़ायदा नहीं है।

source: Are you tired?
hi: थक गए हो क्या?

source: Can you keep it a secret?
hi: क्या तुम इसे राज़ रख सकते हो?

source: Fat hens lay few eggs.
hi: मोटी मुर्गियाँ कम अंडे देतीं हैं।

source: Some fish fly.
hi: कुछ मछलियाँ उड़ सकतीं हैं।

source: The plane will take off in one hour.
hi: विमान एक घंटे में उड़ान भरेगा।

source: The plane took off exactly at six.
hi: हवाईजहाज़ ने ठीक छः बजे उड़ान ली।

source: The plane will arrive at three.
hi: विमान तीन बजे पहुँचेगा।

source: The plane crash took 200 lives.
hi: विमान दुर्घटना ने दो सौ लोगों की जानें लें लीं।

source: She went to Paris in order to study art.
hi: वह कला का अध्ययन करने पेरिस गई।

source: Don't fail to call me back.
hi: मुझे वापस फ़ोन करना मत भूलना।

source: A hundred years is called a century.
hi: सौ सालों को एक शतक बुलाया जाता है।

source: The ice has melted.
hi: बर्फ़ पिघल गया है।

source: The hospital is near here.
hi: अस्पताल यहाँ से नज़दीक है।

source: It is no less than ten miles to the hospital.
hi: हस्पताल कम-से-कम दस मील दूर है।

source: Sickness prevented him from going out.
hi: वह बीमारी की वजह से बाहर नहीं जा सका।

source: The patient breathed his last.
hi: रोगी ने अपनी आखरी साँस भरी।

source: Poverty often engenders crime.
hi: अप्राध की पैदाइश अक्सर ग़रीबी में होती है।

source: I helped my father water the flowers.
hi: मैंने अपने पापा को फूलों को पानी डालने में मदद करी थी।

source: Where did dad go?
hi: पापा कहाँ गए?

source: My father's hair has grown white.
hi: मेरे पापा के बाल सफ़ेद हो गए हैं।

source: My father caught three fish yesterday.
hi: मेरे पिता ने कल तीन मछलीयां पकड़ी।

source: My father has just come home.
hi: मेरे पापा अभी अभी घर वापस आएँ हैं।

source: My father can speak English well.
hi: मेरे पिताजी को अंग्रेज़ी अच्छे से बोलना आता है।

source: Father is watering flowers.
hi: पापा फूलों को पानी दे रहे हैं।

source: Father kept in touch with us by mail and telephone while he was overseas.
hi: जब पिताजी विदेश में थे, वे हमारे साथ चिट्ठी और फ़ोन से सम्पर्क करते थे।

source: Father has recently come back to Japan.
hi: पिताजी हाल ही में जापान लौट आए हैं।

source: My father consented to my going abroad.
hi: मेरे पिता मेरे विदेश जाने से राज़ी थे।

source: Father objected to my going to the mountain alone.
hi: पिताजी मेरे पहाड़ पर अकेले जाने से राज़ी नहीं थे।

source: Father bought me a camera.
hi: पिताजी ने मेरे लिए एक कैमरा खरीदा।

source: My father told me not to read books in bed.
hi: मेरे पिता ने मुझसे बिस्तर में किताबें पढ़ने से मना किया।

source: Father sometimes took me to his office.
hi: पापा कभी-कभी मुझे दफ़्तर ले जाया करते थे।

source: Father is proud of his car.
hi: पिताजी को अपने गाड़ी पर गर्व है।

source: My father works for a power company.
hi: मेरे पापा बिजली की कम्पनी में काम करते हैं।

source: Don't give in.
hi: हार मत मान लो।

source: There was no one in the room.
hi: कमरे में कोई नहीं था।

source: Shall I clean the room?
hi: मैं कमरे की सफ़ाई करूँ क्या?

source: When you leave the room, please make sure you turn off the lights.
hi: कमरे से निकलने से पहले, कृपया बत्तियाँ बंद कर दीजिएगा।

source: The wind scattered the leaves about.
hi: हवा ने पत्तियों को यहाँ-वहाँ बिखेर दिया।

source: The wind carries seeds for great distances.
hi: हवा बीजों को दूर-दूर तक लेजाती है।

source: Keep down, or you'll be shot.
hi: नीचे रहो, नहीं तो तुम्हें गोली लग जाएगी।

source: Don't lose your temper.
hi: नाराज़ मत हो जाओ।

source: We've run out of paper for the photocopier.
hi: फ़ोटोकॉपियर में कागज़ खतम हो गया है।

source: I'd like to get a refund.
hi: मुझे अपने पैसे वापस चाहिए।

source: Buddhism had its beginnings in India.
hi: बौद्ध धर्म भारत में पैदा हुआ था।

source: Physics is my favorite subject.
hi: भौतिक विज्ञान मेरा सबसे पसंदीता विषय है।

source: I know.
hi: पता है।

source: Culture destroys language.
hi: संस्कृति भाषा का सर्वनाश करती है।

source: Don't ask.
hi: पूछ मत।

source: Soldiers are used to danger.
hi: सिपाहियों को खतरे से खेलने की आदत होती है।

source: Show me another example.
hi: मुझे एक और उदाहरण दो।

source: That's weird.
hi: अजीब बात है।

source: No answer is also an answer.
hi: जवाब न देना भी एक तरह का जवाब होता है।

source: She is intense in her study.
hi: वह अपनी पढ़ाई में बहुत ध्यान लगाती है।

source: Study!
hi: पढ़ो!

source: It is your duty to study.
hi: पढ़ाई करना तुम्हारा कर्त्तव्य है।

source: Got it!
hi: पकड़ लिया!

source: I am tired with walking.
hi: मैं चल-चलकर थक गया हूँ।

source: Mother is making tea for us.
hi: माँ हमारे लिये चाय बना रही है।

source: Mother and I are different in every way.
hi: मम्मी और मैं किसी भी पहलू में एक-समान नहीं हैं।

source: I am looking for a present for my mother.
hi: मैं अपनी मम्मी के लिए तोह्फ़ा ढूँढ रहा हूँ।

source: Mother bought a beautiful doll for her.
hi: माँ ने उसके लिए एक सुन्दर सी गुड़िया खरीदी।

source: My mother put clean sheets on the bed.
hi: मेरी माँ ने बिस्तर पर साफ़ चादर बिछाई।

source: Mother bought me the book.
hi: मम्मी ने मेरे लिए वह किताब खरीदी।

source: Mother told me to mow the lawn.
hi: मेरी माँ ने मुझसे घास काटने के लिए कहा।

source: A mother is responsible for the conduct of her children.
hi: एक माँ अपने बच्चों के बर्ताव के लिए ज़िम्मेदार होती है।

source: The mother is leading her child by the hand.
hi: माँ हाथ पकड़कर अपने बच्चे को ले जा रही है।

source: You'll be punished if you break the law.
hi: अगर तुम कानून तोड़ोगे तो तुम्हे सज़ा मिलेगी।

source: The law says that all men are equal.
hi: क़ानून के मुताबिक सभी मनुष्य समान हैं।

source: It is very important to keep the law.
hi: क़ानूनों का पालन करना बहुत ज़रूरी है।

source: Don't forget to return the book to the library.
hi: उस किताब को पुस्तकालय को लौटाना मत भूलना।

source: You should write it down before you forget it.
hi: तुम्हें इसे लिख लेना चाहिए, जिससे पहले कि तुम भूल जाओ।

source: I'll admit I'm wrong.
hi: मैं मानता हूँ कि मैं ग़लत था।

source: It's not my fault.
hi: मेरी ग़लती नहीं है।

source: We cannot decide whether to go to college or not.
hi: हम यह फ़ैसला नहीं ले पा रहें हैं कि कॉलेज जाएं या न जाएं।

source: Tell me the truth.
hi: मुझे सच्चाई बताओ।

source: There is a Tanaka in my class, too.
hi: मेरी कक्षा में भी एक तानाका है।

source: Do you know my brother Masao?
hi: तुम मेरे भय्या मसाओ को जानते हो क्या?

source: You may use my car at any time.
hi: तुम मेरी कार कभी भी इस्तेमाल कर सकते हो।

source: I can't walk any further.
hi: मैं और नहीं चल सकती।

source: I have to go now.
hi: मुझे अभी जाना है।

source: I'll stay home.
hi: मैं घर पर ही रहूँगा।

source: I guess I'm not as smart as you.
hi: मुझे लगता है मैं आपकी तरह चुस्त नहीं हूँ.

source: I'll be on duty this Sunday.
hi: मैं इस रविवार को ड्यूटी पर हूँगा।

source: I am doing business on a large scale.
hi: मैं बड़े पैमाने पर व्यापार कर रहा हूँ।

source: I have a dictionary.
hi: मेरे पास एक शब्दकोश है।

source: I want to marry her.
hi: मैं उससे शादी करना चाहता हूँ।

source: You are allowed to check out not more than five books at a time.
hi: आपको एक समय में केवल पांच पुस्तकों को ले जाने की इजाज़त है.

source: A book is made of paper.
hi: किताब कागज़ का बना होता है।

source: Have you ever written a book?
hi: आपने कभी किताब लिखी है क्या?

source: I am reading a book.
hi: मैं किताब पढ़ रही हूँ।

source: "How can I lose?" answered Satan. "All the umpires are down here in Hell."
hi: "मैं हार कैसे सकता हूँ?" शैतान ने जवाब दिया। "सभी अंपायर तो यहीं नर्क में हैं।"

source: My sister has a job.
hi: मेरी बहन के पास नौकरी है।

source: My sister has long legs.
hi: मेरी बहन की टांगें बहुत लम्बीं हैं।

source: I wake him at six every morning.
hi: मैं हर सुबह छः बजे उसको उठाती हूँ।

source: I think it is very good to lead a regular life.
hi: मेरे ख़याल से आम ज़िन्दगी जीना बहुत अच्छी बात है।

source: You must clean your room every day.
hi: अपना कमरा हर रोज़ साफ़ करना चाहिये।

source: I go every year.
hi: मैं हर साल जाता हूँ।

source: She was late once again.
hi: वह एक बार फिर देर से आई।

source: If you should die, what would become of your family?
hi: अगर तुम मर गए तो तुम्हारे परिवार का क्या होगा?

source: How about the taste?
hi: और स्वाद कैसा है?

source: Are you sleepy?
hi: नींद आई है?

source: In order to stay awake I may have to drink more coffee.
hi: मुझे जगे रहने के लिए शायद और कॉफ़ी पीनी पड़ेगी।

source: It's like a dream come true.
hi: मानो कोई सपना सच आ गया हो।

source: It's for free.
hi: यह मुफ़्त है।

source: A good idea occurred to me last night.
hi: मुझे कल सोते समय दिमाग़ में एक अच्छा आयडिया आया।

source: A good idea suddenly struck her.
hi: अचानक उसे एक अच्छा आइडिया आया।

source: My name is Ichiro Tanaka.
hi: मेरा नाम इचिरो तानाका है।

source: Where there is life, there is hope.
hi: जहाँ जीवन, वहाँ आशा।

source: Will you turn on the light?
hi: बत्ती चालू कर दोगे क्या?

source: Put out the light and go to bed.
hi: बत्ती बंद करो और सो जाओ।

source: Do we have to get up early tomorrow morning?
hi: क्या हमे कल सुबह जल्दी उठना है?

source: Mind you call me up tomorrow.
hi: मुझे कल फ़ोन करना न भूल जाना।

source: Don't forget to come here at seven tomorrow.
hi: कल यहाँ सात बजे आना न भूलना।

source: You can get in touch with me tomorrow.
hi: तुम मुझे कल मिलो.

source: I'd like to see him tomorrow afternoon.
hi: मैं उससे कल दोपहर को मिलना चाहता हूँ।

source: I don't think that it will rain tomorrow.
hi: मुझे नहीं लगता कल बारिश होगी।

source: We may not win tomorrow.
hi: हम कल शायद नहीं जीतेंगे।

source: The store will be closed tomorrow.
hi: दुकान कल बंद रहेगा।

source: Tomorrow is my birthday and I will be seventeen.
hi: कल मेरा जन्मदिन है, और मैं सत्रह साल का हो जाऊँगा।

source: Come see me again tomorrow.
hi: मुझसे कल फिर आकर मिलना।

source: I don't know if it will rain tomorrow.
hi: मुझे मालूम नहीं कल बारिश होगी या नहीं।

source: I'm going to meet him tomorrow.
hi: मैं कल उससे मिलने जा रहा हूँ।

source: You shall have an answer tomorrow.
hi: तुम्हें कल जवाब मिल जाएगा।

source: Do not trust such men as praise you to your face.
hi: जो लोग तुम्हारे सामने तुम्हारी अच्छाई करते हैं, ऐसे लोगों का भरोसा नहीं करना चाहिए।

source: The bicycle under the tree is mine.
hi: पेड़ के नीचे वाली साइकिल मेरी है।

source: I see a house among the trees.
hi: पेड़ों के बीच मुझे एक घर नज़र आ रहा है।

source: The leaves began to turn red and yellow.
hi: पन्ने लाल और पीले होने लगे।

source: The leaves blew off.
hi: पन्ने उड़ गये।

source: Hold your tongue, or you'll be killed.
hi: अपनी ज़बान बंद रखो, नहीं तो मारे जाओगे।

source: It was night.
hi: रात थी।

source: The arrow indicates the way to Tokyo.
hi: यह ऐरो टोक्यो का रास्ता दिखाता है।

source: I want you to keep your promise.
hi: मैं चाहता हूँ कि तुम अपना वादा निभाओ।

source: Don't go back on your promise.
hi: अपना वादा मत तोड़ो।

source: I will find out how the medicine works.
hi: मैं पता लगाऊँगा कि यह दिवाई कैसे काम करती है।

source: Take medicine.
hi: दवाई लो।

source: I have got your name from my friend.
hi: मुझे आपका नाम अपने दोस्त से मिला है।

source: I advise you not to borrow money from your friends.
hi: मेरी तुम्हारे लिए यह सलाह है कि अपने दोस्तों से पैसे उधार मत लो।

source: My friends celebrated my birthday.
hi: मेरे दोस्तों ने मेरा जन्मदिन मनाया।

source: In addition to being a famous physicist, he is a great novelist.
hi: प्रसिद्ध भौतिक विज्ञानी होने के साथ-साथ वे एक बढ़िया उपन्यासकार भी हैं।

source: Yumi went there by herself.
hi: यूमी वहाँ अकेले गई थी।

source: The male peacock has colorful tail feathers.
hi: मोर की पूंछ के पंख रंग-बिरंगी होते हैं।

source: Last night you forgot to turn off the radio, didn't you?
hi: तुम कल रात रेडियो को बंद करना भूल गए थे ना?

source: What would you like for supper?
hi: आप रात में खाने के लिए क्या खाना चाहेंगे?

source: My father went jogging after dinner.
hi: मेरे पापा रात को खाना खाने के बाद दौड़ने गए थे।

source: Do you have an appointment?
hi: आपके पास अपौइंटमेंट है क्या?

source: Open an account.
hi: खाता खोलें।

source: Do you believe in fairies?
hi: तुम परियों में विश्वास करते हो क्या?

source: In brief, the party was splendid.
hi: संक्षेप में कहें तो पार्टी बेहद अच्छी थी.

source: He said he would see me the next day.
hi: उसने कहा था कि वह मुझसे अगले दिन मिलेगा।

source: Something must have happened to him on the way.
hi: उसके साथ रास्ते पर कुछ हुआ होगा।

source: Won't you come and see me next week?
hi: मुझे अगले हफ़्ते देखने आओगे ना?

source: I'll be in Tokyo on business next week.
hi: मैं अगले हफ़्ते टोक्यो में हूँगा काम पर।

source: I want to study abroad next year.
hi: मुझे अगले साल विदेश जाकर पढ़ाई करने का मन है।

source: How do you like your eggs done?
hi: तुम्हे अपने अँडे कैसे पसंद हैं?

source: The storm did great harm to the crop.
hi: तूफ़ान ने फ़सल को बहुत नुक्सान पहुँचाया।

source: A selfish man thinks of nothing but his own feelings.
hi: मतलबी इनसान केवल अपनी भावनाओं के बारे में ही सोचता है।

source: I met him at the barber's.
hi: मैं उससे नाई के यहाँ मिला।

source: Frankly speaking, I don't want to work with him.
hi: खुलकर बोलूँ तो मैं उसके साथ काम नहीं करना चाहता।

source: Stand up!
hi: खड़ा हो!

source: Those standing were all men.
hi: जो खड़े थे, वे सब पुरुष थे।

source: Let's try and swim against the current.
hi: चलो बहाव के खिलाफ़ तैरने की कोशिश करते हैं।

source: Hands up!
hi: हाथ ऊपर करो!

source: Our parents took care of us and now it's our turn to take care of them.
hi: हमारे माता-पिता ने हमारी देखभाल की थी और अभ हमारी बारी है उनकी देखभाल करने की।

source: My parents have just arrived at the station.
hi: मेरे माता-पिता अभी-अभी स्टेशन पर पहुँचें हैं।

source: Parents are responsible for the safety of their children.
hi: मातापिता अपने बच्चों की हिफ़ाज़त के लिए ज़िम्मेदार होते हैं।

source: I'm a good cook.
hi: मैं अच्छा रसोइया हूँ।

source: How can you tell good English from bad English?
hi: तुम अच्छी और बुरी अंग्रेज़ी में कैसे अंतर कर सकते हो?

source: That's better.
hi: यह बेहतर है।

source: Mother White next door likes reading.
hi: पड़ोसवाली मदर व्हाईट को किताबें पढ़ना पसंद है।

source: Tears fell down her cheeks.
hi: आँसू उसकी गालों पर बह गए।

source: The history class starts at nine.
hi: इतिहास की क्लास नौ बजे शुरू होती है।

source: We arrived at the station as the train was leaving.
hi: हम स्टेशन पर तब पहुँचे जब ट्रेन चल पड़ी थी।

source: The train is made up of fifteen cars.
hi: रेलगाड़ी में १५ डब्बे हैं।

source: I think the train will come soon.
hi: मुझे लगता है ट्रेन आने ही वाली है।

source: The train came to a smooth stop.
hi: ट्रेन हल्के से आकर रुकी।

source: The train is ten minutes behind today.
hi: आज ट्रेन दस मिनट लेट है।

source: The train ran off the tracks.
hi: ट्रेन पटरी से उतर गई।

source: Smoking is banned in the train.
hi: ट्रेन के अंदर धूम्रपान करने पर प्रतिबंध लगा हुआ है।

source: Is this love?
hi: क्या यही प्यार है?

source: The workers were laid off for three weeks.
hi: कर्मचारियों को तीन हफ़्तों के लिए काम से निकाल दिया गया।

source: Let's leave it at that.
hi: बात वहीं पर छोड़ देते हैं।

source: How many strokes does the kanji for "michi" have?
hi: "मिचि" के कान्जी में किती रेखाएं होती हैं?

source: The speed of the spread of AIDS is horrifyingly fast.
hi: एड्स के फैलाव की तेज़ गति बहुत भयानक है।

source: Helen's words suddenly filled me with new energy.
hi: हेलेन के शब्दों से मुझमें अचानक नई जान आ गई।

source: This is an important thing for all of you.
hi: यह आप सब के लिए एक बहुत महत्वपूर्ण मामला है।

source: Man can't live without dreams.
hi: इनसान सपने देखे बिना जी नहीं सकता है।

source: Even so ... she didn't have to slap me!
hi: फिर भी ... उसे मुझे थप्पड मारने की कोई ज़रूरत नहीं थी!

source: Coincidentally enough, I know him.
hi: इत्तेफ़ाक से, मैं उसे जानता हूँ।

source: How does the moon shine at night?
hi: रात को चाँद कैसे चमकता है?

source: Women want to have sex too.
hi: महिलाएं भी सेक्स करना चाहतीं हैं।

source: It gets cold in the mornings and evenings, so I want to take care how I dress.
hi: सुबह-शाम को ठंड हो जाती है, इसलिए मैं ढंग से कपड़े पहनना चाह्ती हूँ।

source: Wooden buildings catch fire easily.
hi: लकड़ी से बनी इमारतों में आग आसानी से लग जाती है।

source: Good morning!
hi: सुप्रभात!

source: I am grateful to them.
hi: मैं उनका आभारी हूँ।

source: I am eating rice.
hi: मैं चावल खा रहा हूँ।

source: The radio is powered off.
hi: रेडियो बंद है।
